In [97]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.model_selection import train_test_split, KFold
from sklearn.tree import DecisionTreeClassifier
from sklearn.metrics import accuracy_score
%matplotlib inline

titanic_df = pd.read_csv('titanic_train.csv')
survived_df = pd.read_csv('gender_submission.csv')
test_df = pd.read_csv('test.csv')

In [98]:
tempt_df = pd.merge(test_df, survived_df)

In [100]:
result_df = pd.concat([titanic_df, tempt_df])
full_df = pd.to_csv()

In [101]:
result_df.isna().sum()

PassengerId       0
Survived          0
Pclass            0
Name              0
Sex               0
Age             263
SibSp             0
Parch             0
Ticket            0
Fare              1
Cabin          1014
Embarked          2
dtype: int64

In [28]:
test_df.head(3)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q

In [21]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   1309 non-null   int64
 1   PassengerId  1309 non-null   int64
 2   Survived     891 non-null    float64
 3   Pclass       1309 non-null   int64
 4   Name         1309 non-null   object
 5   Sex          1309 non-null   object
 6   Age          1046 non-null   float64
 7   SibSp        1309 non-null   int64
 8   Parch        1309 non-null   int64
 9   Ticket       1309 non-null   object
 10  Fare         1308 non-null   float64
 11  Cabin        295 non-null    object
 12  Embarked     1307 non-null   object
dtypes: float64(3), int64(5), object(5)
memory usage: 133.1+ KB

In [23]:
titanic_df.isna().sum()

Unnamed: 0        0
PassengerId       0
Survived        418
Pclass            0
Name              0
Sex               0
Age             263
SibSp             0
Parch             0
Ticket            0
Fare              1
Cabin          1014
Embarked          2
dtype: int64

In [118]:
a = {
    'ID' : ['C', 'D'],
    'd' : [10, 20]
}

b = {
    'ID' : ['A', 'B', 'C', 'D'],
    'c' : [30, 40, 50, 60],
    'd' : [100, 1000, None, None],
    'b' : [5, 6, 7, 8]
}

df1 = pd.DataFrame(a)
df2 = pd.DataFrame(b)
print(df1)
print(df2)

print(df1['d'].index.tolist())

  ID   d
0  C  10
1  D  20
  ID   c       d  b
0  A  30   100.0  5
1  B  40  1000.0  6
2  C  50     NaN  7
3  D  60     NaN  8
[0, 1]

In [115]:
new_column = pd.Series(['d', 'e'], name='B', index=[0, 2])
print(new_column)

0    d
2    e
Name: B, dtype: object